guix.org
# -*- ispell-dictionary: "english" -*-
:PROPERTIES:
:ID:       1ffbcfb3-9c0d-4776-b163-b737369328b4
:CREATED:  2024-04-02T22:46:19
:END:
#+title: Guix: elevate your computing
#+LANGUAGE: english

* Why Guix?

Guix, which is a package manager similar to [[https://nixos.org/][Nix]], takes a different approach to
functional package management that reuses GNU's extension language, [[https://www.gnu.org/software/guile/][Guile
scheme]], instead of nix (the language) as a package definition domain specific
language. By using scheme, an extendable and Turing complete language, it opens
the door to a world of possibilities. It enables the use of macros, of complex
algorithms and of a rich set of types through which users can express packages.

