guix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="english" xml:lang="english">
<head>
<!-- 2024-09-15 Sun 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guix: elevate your computing</title>
<meta name="author" content="Justin Veilleux" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Guix: elevate your computing</h1>

<div id="outline-container-orga2081b5" class="outline-2">
<h2 id="orga2081b5"><span class="section-number-2">1.</span> Why Guix?</h2>
<div class="outline-text-2" id="text-1">
<p>
Guix, which is a package manager similar to <a href="https://nixos.org/">Nix</a>, takes a different approach to
functional package management that reuses GNU's extension language, <a href="https://www.gnu.org/software/guile/">Guile
scheme</a>, instead of nix (the language) as a package definition domain specific
language. By using scheme, an extendable and Turing complete language, it opens
the door to a world of possibilities. It enables the use of macros, of complex
algorithms and of a rich set of types through which users can express packages.
</p>
</div>
</div>
