guix.org
* A crash course on creating a package

Let's say you, a user of Guix, want to use a specific piece of software which is
not currently in Guix. I'll use as an example transmission-remote-gtk because
it was one of the first packages I wrote.

A great way to learn something new is by looking at examples. In our case, we
will familiarize ourselves with the anatomy of a package by looking at a very
simple package: hello.

We can easily open in our favorite text editor the definition for a package by
invoking =guix edit=.

#+begin_src scheme
;; $ guix edit hello

(define-public hello
  (package
   (name "hello")
   (version "2.10")
   (source (origin
            (method url-fetch)
            (uri (string-append "mirror://gnu/hello/hello-" version
                                ".tar.gz"))
            (sha256
             (base32
              "0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i"))))
   (build-system gnu-build-system)
   (synopsis "Hello, GNU world: An example GNU package")
   (description
    "GNU Hello prints the message \"Hello, world!\" and then exits.  It
serves as an example of standard GNU coding practices.  As such, it supports
command-line arguments, multiple languages, and so on.")
   (home-page "https://www.gnu.org/software/hello/")
   (license gpl3+)))

#+end_src

Let's look over the basic anatomy of the =hello= package.

First, we can see that in Guix, every package is a value stored in some
module. The fact that packages are simply values inhabiting some module means,
as we will see later, that you can manipulate them just like any record in any
programming language. You can see where the package is defined by using the
=guix show= command.

#+begin_src shell :results output :exports both
guix show hello
#+end_src

#+RESULTS:
#+begin_example
name: hello
version: 2.12.1
outputs:
+ out: everything
systems: x86_64-linux i686-linux
dependencies: 
location: gnu/packages/base.scm:92:2
homepage: https://www.gnu.org/software/hello/
license: GPL 3+
synopsis: Hello, GNU world: An example GNU package  
description: GNU Hello prints the message "Hello, world!" and then exits.  It
+ serves as an example of standard GNU coding practices.  As such, it supports
+ command-line arguments, multiple languages, and so on.

#+end_example

Here, =package= is the form used to create the record and define all of its
attributes.

- =name= is pretty self-explanatory. It's simply a string used to name the
  package. This is actually what will be used by Guix to present packages to the
  user (=guix install=, =guix search=, =guix show=, etc.)

-  =version= is the version. It is not necessary to use a particular scheme, but
  Guix is still able to recognize the most up-to-date version.

- =source= is a file-like-object (more on that later, you will hear this term a
  lot) which points to the source code of the package

- =buid-system= is a value of type =<build-system>= used to abstract away the
  repetitive =./configure && make && make install= dance often used when compiling
  software.

- =synopsis=, =description= and =home-page= contain, respectively, a short summary of
  the package's purpose, a longer description and the webpage which one can
  visit to learn more about the project.

- =license= contains a =<license>= record that will be used by guix to determine the
  package's license. The fact it isn't simply a string makes the idea of
  programmatically combing through a list of packages with a certain license
  possible.

Now that we understand a bit better what goes into a package, we are one
step closer to creating our own. But before we start, it might be useful to know
how one is supposed to actually use that package we are writing.

To instruct guix to build a package, we use the src_shell{guix build} command.
If we give it a package name, as in src_shell{guix build hello}, it will find
hello in our =GUIX_PACKAGE_PATH= environment variable and if it doesn't find it,
in the =(guix packages ...)= modules.

We could modify the =GUIX_PACKAGE_PATH= environment variable, but a simpler way
is to simply pass the =-f= flag to =guix build=. When we actually have a package
to build, that's what we are going to do.

First, let's create an empty scheme file, then type in an ill-formed package
definition.

#+begin_src scheme :exports code
;; package.scm
(package)
#+end_src

If we type =guix build -f package.scm= into our terminal, we will receive a
helpful error message and a nice hint.

#+begin_src
/home/terramorpha/test/tmp.Sms/main.scm:1:1: error: package: unbound variable
hint: Did you forget `(use-modules (guix packages))'?
#+end_src

Oh! we need to actually import the module containing the =(package)= form. Let's try again.

#+begin_src scheme :exports code
;; package.scm
(use-modules (guix packages))
(package)
#+end_src

This time, we get a different kind of error, there are missing fields.

#+begin_src
/home/terramorpha/test/tmp.Sms/main.scm:3:0: error: (package): missing field initializers (name version source build-system synopsis description license home-page)
#+end_src

The majority of those fields, we can already fill them. What we end up with is
the following incomplete definition:

#+begin_src scheme
(use-modules (guix packages))

(package
 (name "transmission-remote-gtk")
 (version "1.4.1")
 ;; (source ???)
 ;; (build-system ???)
 (synopsis "graphical frontend to the Transmission daemon")
 (description "transmission-remote-gtk is a GTK client for remote management of
the Transmission BitTorrent client, using its HTTP RPC protocol.")
 ;; (license ???)
 (home-page "https://github.com/transmission-remote-gtk/transmission-remote-gtk"))
#+end_src

The simplest field to fill would be =license=. We can find the licenses that are
already defined in the =(guix licenses)= module. You can fire up a guile repl
using =guix repl= and type the following form:

#+begin_src scheme
(use-modules ((guix licenses) #:prefix license:))
#+end_src

now, you can type =license:= and tab complete your way to the correct value. If
we look at the github repository, we notice the project is licensed under the
GPL 2. Let's update our code accordingly.

#+begin_src scheme
(use-modules (guix packages)
             ((guix licenses) #:prefix license:))

(package
 (name "transmission-remote-gtk")
 (version "1.4.1")
 ;; (source ???)
 ;; (build-system ???)
 (synopsis "graphical frontend to the Transmission daemon")
 (description "transmission-remote-gtk is a GTK client for remote management of
the Transmission BitTorrent client, using its HTTP RPC protocol.")
 (license license:gpl2)
 (home-page "https://github.com/transmission-remote-gtk/transmission-remote-gtk"))
#+end_src

We are still missing the =source= and =build-system= fields.

The lowest hanging fruit seems to be the =build-system=. If we look inside one
of the release tarballs of the github repo, we recognize an =autogen.sh=
file. This must be a regular GNU autotools setup.

the =<build-system>= for such software is located in the =(guix buid-system
gnu)= and is named =gnu-build-system=.

We import the necessary module and modify our definition:

#+begin_src scheme
(use-modules (guix packages)
             ((guix licenses) #:prefix license:)
             (guix build-system gnu))

(package
 (name "transmission-remote-gtk")
 (version "1.4.1")
 ;; (source ???)
 (build-system gnu-build-system)
 (synopsis "graphical frontend to the Transmission daemon")
 (description "transmission-remote-gtk is a GTK client for remote management of
the Transmission BitTorrent client, using its HTTP RPC protocol.")
 (license license:gpl2)
 (home-page "https://github.com/transmission-remote-gtk/transmission-remote-gtk"))
#+end_src

Now, the only field left to fill is =source=. This is, in my opinion, the part
which requires a bit of an explanation.

Guix is what is called a functional package manager. One of the consequences of
the "purely functional package manager" approach is that the dependencies of a
package are explicit. This means that every package, to be built, must come with
an explicit list of all other packages which it will need to both run and
compile. In the nix world, the smallest unit which possesses thes properties is
the derivation. A derivation contains references to every build dependency:
compilers, dynamic libraries, /et cetera/. Guix uses a similar but different
approach. It has many types of objects which can be "compiled" down to a
derivation. A package is such an object. In the case of our package, the
dependencies would be =gtk=, some other things and the compiler toolchain. The
instructions on how to build it would be the =gnu-build-system= and it's output
would be simply =out= (the default name of a package with only one output).

Then, where does the source code of a package come from? It's certainly one
of it's dependencies, but how can we define the source code in terms of
derivations. To download data from the internet, we use something called fixed
output derivations. While the build process of a normal derivation happens in an
isolated sandbox to prevent reproducibility issues, fixed output derivations'
output have a fixed hash, so we can let them communicate with the outside world
at build time.

One form defined by the guix libraries to create a fixed output derivation from
an URL is =origin=. It eases the definition of derivations which will simply
download a file from the internet. The =origin= record, located in =guix packages=,
is built from three parts. a =uri=, a =method= and some cryptographic hash. One
=method= we can use to download the source code of our program is url-fetch which
is located in =(guix download)=. We can now fill out parts of the missing =source=
field.

#+begin_src scheme
(use-modules (guix packages)
             ((guix licenses) #:prefix license:)
             (guix build-system gnu)
             (guix download))

(package
 (name "transmission-remote-gtk")
 (version "1.4.1")
 (source (origin (uri "https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz")
                 (method url-fetch)))
 (build-system gnu-build-system)
 (synopsis "graphical frontend to the Transmission daemon")
 (description "transmission-remote-gtk is a GTK client for remote management of
the Transmission BitTorrent client, using its HTTP RPC protocol.")
 (license license:gpl2)
 (home-page "https://github.com/transmission-remote-gtk/transmission-remote-gtk"))
#+end_src

But when we run =guix build -f package.scm=, guix still complains: =missing
field initializers (hash)=

We need to enter a valid hash. One way we can easily download then hash a file
at some url is by using the =guix download= command:

#+begin_src shell :results output :exports both
guix download "https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz"
#+end_src

#+RESULTS:
: /gnu/store/26pkmmascf0pnzcwziy7216hzlqb5rqd-1.4.2.tar.gz
: 02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676


Since guix complains about =hash=, a beginner would probably try to fill this
one, but the guix codebase actually seems to prefer the alternative: =sha256=

We end up with the following:

#+begin_src scheme
(use-modules (guix packages)
             ((guix licenses) #:prefix license:)
             (guix build-system gnu)
             (guix download))

(package
 (name "transmission-remote-gtk")
 (version "1.4.1")
 (source (origin (uri "https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz")
                 (method url-fetch)
                 (sha256 (base32 "02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676"))))
 (build-system gnu-build-system)
 (synopsis "graphical frontend to the Transmission daemon")
 (description "transmission-remote-gtk is a GTK client for remote management of
the Transmission BitTorrent client, using its HTTP RPC protocol.")
 (license license:gpl2)
 (home-page "https://github.com/transmission-remote-gtk/transmission-remote-gtk"))

#+end_src

When running =guix build -f package.scm=, this time we actually get past the
evaluation phase and get an error in the build phase. What an improvement!

If you read carefully the output of the builder, you will see an =aclocal:
command not found= Weren't we supposed to *explicitly* declare all dependencies?
Yes. Let me now introduce you to the =inputs= field.

#+begin_src scheme
(use-modules (guix packages)
             ((guix licenses) #:prefix license:)
             (guix build-system gnu)
             (gnu packages autotools)
             (gnu packages gettext)
             (guix download))

(package
 (name "transmission-remote-gtk")
 (version "1.4.1")
 (source (origin (uri "https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz")
                 (method url-fetch)
                 (sha256 (base32 "02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676"))))

 (inputs
  (list
   automake
   gnu-gettext))

 (build-system gnu-build-system)
 (synopsis "graphical frontend to the Transmission daemon")
 (description "transmission-remote-gtk is a GTK client for remote management of
the Transmission BitTorrent client, using its HTTP RPC protocol.")
 (license license:gpl2)
 (home-page "https://github.com/transmission-remote-gtk/transmission-remote-gtk"))
#+end_src

Inputs are a way to allow a package to reference other packages at compile
time. Since we know that aclocal comes with the =automake= package, let's add it
to the list of inputs.

If we retry to build the package, this time, we get an error about gettext.
Let's add it.

Note: you can look for packages by using =guix search=. the output will contain
the necessary module to include. You can query the specific variable name of the
package by using =guix edit=

For each complaint that we get, we try to add to the inputs the correct
package. At the end, we get:

#+begin_src scheme
(use-modules (guix packages)
             ((guix licenses) #:prefix license:)
             (guix build-system gnu)
             (gnu packages autotools)
             (gnu packages gettext)
             (gnu packages glib)
             (gnu packages pkg-config)
             (gnu packages gtk)
             (gnu packages curl)
             (gnu packages gnome)
             (guix download))

(package
 (name "transmission-remote-gtk")
 (version "1.4.1")
 (source (origin (uri "https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz")
                 (method url-fetch)
                 (sha256 (base32 "02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676"))))

 (inputs
  (list
   automake
   gnu-gettext
   autoconf
   autoconf-archive
   appstream-glib
   libtool
   pkg-config
   gtk+
   curl
   json-glib))
 (build-system gnu-build-system)
 (synopsis "graphical frontend to the Transmission daemon")
 (description "transmission-remote-gtk is a GTK client for remote management of
the Transmission BitTorrent client, using its HTTP RPC protocol.")
 (license license:gpl2)
 (home-page "https://github.com/transmission-remote-gtk/transmission-remote-gtk"))

#+end_src

If you want to install this package, you can run =guix package -f
package.scm=. You can also put the file in a directory pointed to by
=GUIX_PACKAGE_PATH= to make it =guix search=-able.

