guix.html

<div id="outline-container-org6860242" class="outline-2">
<h2 id="org6860242"><span class="section-number-2">2.</span> A crash course on creating a package</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's say you, a user of Guix, want to use a specific piece of software which is
not currently in Guix. I'll use as an example transmission-remote-gtk because
it was one of the first packages I wrote.
</p>

<p>
A great way to learn something new is by looking at examples. In our case, we
will familiarize ourselves with the anatomy of a package by looking at a very
simple package: hello.
</p>

<p>
We can easily open in our favorite text editor the definition for a package by
invoking <code>guix edit</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">$ guix edit hello</span>

(<span style="color: #005e8b; font-weight: bold;">define-public</span> <span style="color: #8f0075;">hello</span>
  (package
   (name <span style="color: #a0132f;">"hello"</span>)
   (version <span style="color: #a0132f;">"2.10"</span>)
   (source (origin
            (method url-fetch)
            (uri (string-append <span style="color: #a0132f;">"mirror://gnu/hello/hello-"</span> version
                                <span style="color: #a0132f;">".tar.gz"</span>))
            (sha256
             (base32
              <span style="color: #a0132f;">"0ssi1wpaf7plaswqqjwigppsg5fyh99vdlb9kzl7c9lng89ndq1i"</span>))))
   (build-system gnu-build-system)
   (synopsis <span style="color: #a0132f;">"Hello, GNU world: An example GNU package"</span>)
   (description
    <span style="color: #a0132f;">"GNU Hello prints the message \"Hello, world!\" and then exits.  It</span>
<span style="color: #a0132f;">serves as an example of standard GNU coding practices.  As such, it supports</span>
<span style="color: #a0132f;">command-line arguments, multiple languages, and so on."</span>)
   (home-page <span style="color: #a0132f;">"https://www.gnu.org/software/hello/"</span>)
   (license gpl3+)))

</pre>
</div>

<p>
Let's look over the basic anatomy of the <code>hello</code> package.
</p>

<p>
First, we can see that in Guix, every package is a value stored in some
module. The fact that packages are simply values inhabiting some module means,
as we will see later, that you can manipulate them just like any record in any
programming language. You can see where the package is defined by using the
<code>guix show</code> command.
</p>

<div class="org-src-container">
<pre class="src src-shell">guix show hello
</pre>
</div>

<pre class="example" id="org7896dde">
name: hello
version: 2.12.1
outputs:
+ out: everything
systems: x86_64-linux i686-linux
dependencies: 
location: gnu/packages/base.scm:100:2
homepage: https://www.gnu.org/software/hello/
license: GPL 3+
synopsis: Hello, GNU world: An example GNU package  
description: GNU Hello prints the message "Hello, world!" and then exits.  It
+ serves as an example of standard GNU coding practices.  As such, it supports
+ command-line arguments, multiple languages, and so on.

</pre>

<p>
Here, <code>package</code> is the form used to create the record and define all of its
attributes.
</p>

<ul class="org-ul">
<li><code>name</code> is pretty self-explanatory. It's simply a string used to name the
package. This is actually what will be used by Guix to present packages to the
user (<code>guix install</code>, <code>guix search</code>, <code>guix show</code>, etc.)</li>

<li><code>version</code> is the version. It is not necessary to use a particular scheme, but
Guix is still able to recognize the most up-to-date version.</li>

<li><code>source</code> is a file-like-object (more on that later, you will hear this term a
lot) which points to the source code of the package</li>

<li><code>buid-system</code> is a value of type <code>&lt;build-system&gt;</code> used to abstract away the
repetitive <code>./configure &amp;&amp; make &amp;&amp; make install</code> dance often used when compiling
software.</li>

<li><code>synopsis</code>, <code>description</code> and <code>home-page</code> contain, respectively, a short summary of
the package's purpose, a longer description and the webpage which one can
visit to learn more about the project.</li>

<li><code>license</code> contains a <code>&lt;license&gt;</code> record that will be used by guix to determine the
package's license. The fact it isn't simply a string makes the idea of
programmatically combing through a list of packages with a certain license
possible.</li>
</ul>

<p>
Now that we understand a bit better what goes into a package, we are one
step closer to creating our own. But before we start, it might be useful to know
how one is supposed to actually use that package we are writing.
</p>

<p>
To instruct guix to build a package, we use the command.
If we give it a package name, as in <code>/gnu/store/8bjy9g0cssjrw9ljz2r8ww1sma95isfj-hello-2.12.1</code>, it will find
hello in our <code>GUIX_PACKAGE_PATH</code> environment variable and if it doesn't find it,
in the <code>(guix packages ...)</code> modules.
</p>

<p>
We could modify the <code>GUIX_PACKAGE_PATH</code> environment variable, but a simpler way
is to simply pass the <code>-f</code> flag to <code>guix build</code>. When we actually have a package
to build, that's what we are going to do.
</p>

<p>
First, let's create an empty scheme file, then type in an ill-formed package
definition.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">package.scm</span>
(package)
</pre>
</div>

<p>
If we type <code>guix build -f package.scm</code> into our terminal, we will receive a
helpful error message and a nice hint.
</p>

<pre class="example">
/home/terramorpha/test/tmp.Sms/main.scm:1:1: error: package: unbound variable
hint: Did you forget `(use-modules (guix packages))'?
</pre>

<p>
Oh! we need to actually import the module containing the <code>(package)</code> form. Let's try again.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">package.scm</span>
(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages))
(package)
</pre>
</div>

<p>
This time, we get a different kind of error, there are missing fields.
</p>

<pre class="example">
/home/terramorpha/test/tmp.Sms/main.scm:3:0: error: (package): missing field initializers (name version source build-system synopsis description license home-page)
</pre>

<p>
The majority of those fields, we can already fill them. What we end up with is
the following incomplete definition:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages))

(package
 (name <span style="color: #a0132f;">"transmission-remote-gtk"</span>)
 (version <span style="color: #a0132f;">"1.4.1"</span>)
 <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(source ???)</span>
 <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(build-system ???)</span>
 (synopsis <span style="color: #a0132f;">"graphical frontend to the Transmission daemon"</span>)
 (description <span style="color: #a0132f;">"transmission-remote-gtk is a GTK client for remote management of</span>
<span style="color: #a0132f;">the Transmission BitTorrent client, using its HTTP RPC protocol."</span>)
 <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(license ???)</span>
 (home-page <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk"</span>))
</pre>
</div>

<p>
The simplest field to fill would be <code>license</code>. We can find the licenses that are
already defined in the <code>(guix licenses)</code> module. You can fire up a guile repl
using <code>guix repl</code> and type the following form:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> ((guix licenses) <span style="color: #721045; font-weight: bold;">#:prefix</span> license:))
</pre>
</div>

<p>
now, you can type <code>license:</code> and tab complete your way to the correct value. If
we look at the github repository, we notice the project is licensed under the
GPL 2. Let's update our code accordingly.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages)
             ((guix licenses) <span style="color: #721045; font-weight: bold;">#:prefix</span> license:))

(package
 (name <span style="color: #a0132f;">"transmission-remote-gtk"</span>)
 (version <span style="color: #a0132f;">"1.4.1"</span>)
 <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(source ???)</span>
 <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(build-system ???)</span>
 (synopsis <span style="color: #a0132f;">"graphical frontend to the Transmission daemon"</span>)
 (description <span style="color: #a0132f;">"transmission-remote-gtk is a GTK client for remote management of</span>
<span style="color: #a0132f;">the Transmission BitTorrent client, using its HTTP RPC protocol."</span>)
 (license license:gpl2)
 (home-page <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk"</span>))
</pre>
</div>

<p>
We are still missing the <code>source</code> and <code>build-system</code> fields.
</p>

<p>
The lowest hanging fruit seems to be the <code>build-system</code>. If we look inside one
of the release tarballs of the github repo, we recognize an <code>autogen.sh</code>
file. This must be a regular GNU autotools setup.
</p>

<p>
the <code>&lt;build-system&gt;</code> for such software is located in the <code>(guix buid-system
gnu)</code> and is named <code>gnu-build-system</code>.
</p>

<p>
We import the necessary module and modify our definition:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages)
             ((guix licenses) <span style="color: #721045; font-weight: bold;">#:prefix</span> license:)
             (guix build-system gnu))

(package
 (name <span style="color: #a0132f;">"transmission-remote-gtk"</span>)
 (version <span style="color: #a0132f;">"1.4.1"</span>)
 <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">(source ???)</span>
 (build-system gnu-build-system)
 (synopsis <span style="color: #a0132f;">"graphical frontend to the Transmission daemon"</span>)
 (description <span style="color: #a0132f;">"transmission-remote-gtk is a GTK client for remote management of</span>
<span style="color: #a0132f;">the Transmission BitTorrent client, using its HTTP RPC protocol."</span>)
 (license license:gpl2)
 (home-page <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk"</span>))
</pre>
</div>

<p>
Now, the only field left to fill is <code>source</code>. This is, in my opinion, the part
which requires a bit of an explanation.
</p>

<p>
Guix is what is called a functional package manager. One of the consequences of
the "purely functional package manager" approach is that the dependencies of a
package are explicit. This means that every package, to be built, must come with
an explicit list of all other packages which it will need to both run and
compile. In the nix world, the smallest unit which possesses thes properties is
the derivation. A derivation contains references to every build dependency:
compilers, dynamic libraries, <i>et cetera</i>. Guix uses a similar but different
approach. It has many types of objects which can be "compiled" down to a
derivation. A package is such an object. In the case of our package, the
dependencies would be <code>gtk</code>, some other things and the compiler toolchain. The
instructions on how to build it would be the <code>gnu-build-system</code> and it's output
would be simply <code>out</code> (the default name of a package with only one output).
</p>

<p>
Then, where does the source code of a package come from? It's certainly one
of it's dependencies, but how can we define the source code in terms of
derivations. To download data from the internet, we use something called fixed
output derivations. While the build process of a normal derivation happens in an
isolated sandbox to prevent reproducibility issues, fixed output derivations'
output have a fixed hash, so we can let them communicate with the outside world
at build time.
</p>

<p>
One form defined by the guix libraries to create a fixed output derivation from
an URL is <code>origin</code>. It eases the definition of derivations which will simply
download a file from the internet. The <code>origin</code> record, located in <code>guix packages</code>,
is built from three parts. a <code>uri</code>, a <code>method</code> and some cryptographic hash. One
<code>method</code> we can use to download the source code of our program is url-fetch which
is located in <code>(guix download)</code>. We can now fill out parts of the missing <code>source</code>
field.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages)
             ((guix licenses) <span style="color: #721045; font-weight: bold;">#:prefix</span> license:)
             (guix build-system gnu)
             (guix download))

(package
 (name <span style="color: #a0132f;">"transmission-remote-gtk"</span>)
 (version <span style="color: #a0132f;">"1.4.1"</span>)
 (source (origin (uri <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz"</span>)
                 (method url-fetch)))
 (build-system gnu-build-system)
 (synopsis <span style="color: #a0132f;">"graphical frontend to the Transmission daemon"</span>)
 (description <span style="color: #a0132f;">"transmission-remote-gtk is a GTK client for remote management of</span>
<span style="color: #a0132f;">the Transmission BitTorrent client, using its HTTP RPC protocol."</span>)
 (license license:gpl2)
 (home-page <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk"</span>))
</pre>
</div>

<p>
But when we run <code>guix build -f package.scm</code>, guix still complains: <code>missing
field initializers (hash)</code>
</p>

<p>
We need to enter a valid hash. One way we can easily download then hash a file
at some url is by using the <code>guix download</code> command:
</p>

<div class="org-src-container">
<pre class="src src-shell">guix download <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz"</span>
</pre>
</div>

<pre class="example">
/gnu/store/26pkmmascf0pnzcwziy7216hzlqb5rqd-1.4.2.tar.gz
02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676
</pre>



<p>
Since guix complains about <code>hash</code>, a beginner would probably try to fill this
one, but the guix codebase actually seems to prefer the alternative: <code>sha256</code>
</p>

<p>
We end up with the following:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages)
             ((guix licenses) <span style="color: #721045; font-weight: bold;">#:prefix</span> license:)
             (guix build-system gnu)
             (guix download))

(package
 (name <span style="color: #a0132f;">"transmission-remote-gtk"</span>)
 (version <span style="color: #a0132f;">"1.4.1"</span>)
 (source (origin (uri <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz"</span>)
                 (method url-fetch)
                 (sha256 (base32 <span style="color: #a0132f;">"02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676"</span>))))
 (build-system gnu-build-system)
 (synopsis <span style="color: #a0132f;">"graphical frontend to the Transmission daemon"</span>)
 (description <span style="color: #a0132f;">"transmission-remote-gtk is a GTK client for remote management of</span>
<span style="color: #a0132f;">the Transmission BitTorrent client, using its HTTP RPC protocol."</span>)
 (license license:gpl2)
 (home-page <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk"</span>))

</pre>
</div>

<p>
When running <code>guix build -f package.scm</code>, this time we actually get past the
evaluation phase and get an error in the build phase. What an improvement!
</p>

<p>
If you read carefully the output of the builder, you will see an <code>aclocal:
command not found</code> Weren't we supposed to <b>explicitly</b> declare all dependencies?
Yes. Let me now introduce you to the <code>inputs</code> field.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages)
             ((guix licenses) <span style="color: #721045; font-weight: bold;">#:prefix</span> license:)
             (guix build-system gnu)
             (gnu packages autotools)
             (gnu packages gettext)
             (guix download))

(package
 (name <span style="color: #a0132f;">"transmission-remote-gtk"</span>)
 (version <span style="color: #a0132f;">"1.4.1"</span>)
 (source (origin (uri <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz"</span>)
                 (method url-fetch)
                 (sha256 (base32 <span style="color: #a0132f;">"02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676"</span>))))

 (inputs
  (list
   automake
   gnu-gettext))

 (build-system gnu-build-system)
 (synopsis <span style="color: #a0132f;">"graphical frontend to the Transmission daemon"</span>)
 (description <span style="color: #a0132f;">"transmission-remote-gtk is a GTK client for remote management of</span>
<span style="color: #a0132f;">the Transmission BitTorrent client, using its HTTP RPC protocol."</span>)
 (license license:gpl2)
 (home-page <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk"</span>))
</pre>
</div>

<p>
Inputs are a way to allow a package to reference other packages at compile
time. Since we know that aclocal comes with the <code>automake</code> package, let's add it
to the list of inputs.
</p>

<p>
If we retry to build the package, this time, we get an error about gettext.
Let's add it.
</p>

<p>
Note: you can look for packages by using <code>guix search</code>. the output will contain
the necessary module to include. You can query the specific variable name of the
package by using <code>guix edit</code>
</p>

<p>
For each complaint that we get, we try to add to the inputs the correct
package. At the end, we get:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix packages)
             ((guix licenses) <span style="color: #721045; font-weight: bold;">#:prefix</span> license:)
             (guix build-system gnu)
             (gnu packages autotools)
             (gnu packages gettext)
             (gnu packages glib)
             (gnu packages pkg-config)
             (gnu packages gtk)
             (gnu packages curl)
             (gnu packages gnome)
             (guix download))

(package
 (name <span style="color: #a0132f;">"transmission-remote-gtk"</span>)
 (version <span style="color: #a0132f;">"1.4.1"</span>)
 (source (origin (uri <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk/archive/refs/tags/1.4.2.tar.gz"</span>)
                 (method url-fetch)
                 (sha256 (base32 <span style="color: #a0132f;">"02dfiqks1wcvbg9h9l16dlgidzyiz498ahl9jcpg876azgsyh676"</span>))))

 (inputs
  (list
   automake
   gnu-gettext
   autoconf
   autoconf-archive
   appstream-glib
   libtool
   pkg-config
   gtk+
   curl
   json-glib))
 (build-system gnu-build-system)
 (synopsis <span style="color: #a0132f;">"graphical frontend to the Transmission daemon"</span>)
 (description <span style="color: #a0132f;">"transmission-remote-gtk is a GTK client for remote management of</span>
<span style="color: #a0132f;">the Transmission BitTorrent client, using its HTTP RPC protocol."</span>)
 (license license:gpl2)
 (home-page <span style="color: #a0132f;">"https://github.com/transmission-remote-gtk/transmission-remote-gtk"</span>))

</pre>
</div>

<p>
If you want to install this package, you can run <code>guix package -f
package.scm</code>. You can also put the file in a directory pointed to by
<code>GUIX_PACKAGE_PATH</code> to make it <code>guix search</code>-able.
</p>
</div>
</div>
