guix.org
* Home directory configuration with Guix home

Some time ago, I decided to ease the transition and the configuration of all my
software by creating a neat little =dotfiles= directory, by having it
synchronized using syncthing and by deploying these configurations with gnu
stow.

In parallel, I also maintained a small collection of scripts which I used
somewhat frequently.

I found the migration of this setup quite annoying. The part with the dotfiles
was fine, thanks to =stow=, but having crucial parts of my workflow fail
(sometimes silently) because I forgot to install ghostscript or qrencode was, to
say the least, annoying.

Until =guix home= happened.

On the surface, =guix home= looks a bit like gnu stow, but with the idea of
"services" which allow you to declaratively instruct your shell to load
zsh-autosuggestions or direnv. However, combined with g-expressions and the
power of the store, magic happens.

** reproductible and hermetic xsession script

What if you wanted to take the exact visual appearance of your window manager,
put it into a scheme file and "evaluate" it later? Read: reproducible rice.

As an experiment, I once created a custom package that, when installed into the
system profile, added an entry in =/share/xsessions/=. An entry that, when run
by the display manager, instructed it to execute a script =~/.startup=. I was
able to get from a display manager to an arbitrary script file while never
leaving Guix's tender embrace.

Of course, if the goal is to prolong this blissful moment, =~/.startup= should
be managed by guix too, right ?

In =guix home='s =home-environment=, you can add a =home-files-service-type=
which lets you declare arbitrary "file-like objects" to be added into your home
directory. Could a g-expression turned into a script be such an object? Yes it
could.

#+begin_src scheme
(home-environment
 ...
 (services
  (list
   ...
   (simple-service 'environment-loader
                   home-files-service-type
                   `(("startup"
                      (program-file "startup" startup-gexp)))))))
#+end_src

In my case, I did multiple things in this script.

#+begin_src scheme
(define startup-gexp
  #~(begin
      (system* #$nitrogen-bin "--set-auto" #wallpaper)
	  (when (zero? (primitive-fork))
	    (exit (system* #$sxhkd-bin "-c" #$sxhkd-config)))
	  (system* #$i3-bin "-c" #$i3-config)))
#+end_src

I started the keybindings daemon, I also started the window manager and set my
wallpaper. All without assuming that either sxhkd, nitrogen or i3 was installed.
I was even able to define my wallpaper as a fixed output derivation

#+begin_src scheme
(define wallpaper
  (origin
	(uri "https://www.dalipaintings.com/images/paintings/metamorphosis-of-narcissus.jpg")
	(method url-fetch)
	(sha256 (base32 "0pn6dmqzakl88f1jxz7b325d98flkjx0fl9p7w2dfkiq3wbv9sn2"))
	(file-name "metamorphosis-of-narcissus.jpg")))
#+end_src

Now, my whole setup is controlled by a single command.


