guix.html

<div id="outline-container-org2aaa3ef" class="outline-2">
<h2 id="org2aaa3ef"><span class="section-number-2">3.</span> Home directory configuration with Guix home</h2>
<div class="outline-text-2" id="text-3">
<p>
Some time ago, I decided to ease the transition and the configuration of all my
software by creating a neat little <code>dotfiles</code> directory, by having it
synchronized using syncthing and by deploying these configurations with gnu
stow.
</p>

<p>
In parallel, I also maintained a small collection of scripts which I used
somewhat frequently.
</p>

<p>
I found the migration of this setup quite annoying. The part with the dotfiles
was fine, thanks to <code>stow</code>, but having crucial parts of my workflow fail
(sometimes silently) because I forgot to install ghostscript or qrencode was, to
say the least, annoying.
</p>

<p>
Until <code>guix home</code> happened.
</p>

<p>
On the surface, <code>guix home</code> looks a bit like gnu stow, but with the idea of
"services" which allow you to declaratively instruct your shell to load
zsh-autosuggestions or direnv. However, combined with g-expressions and the
power of the store, magic happens.
</p>
</div>

<div id="outline-container-org46471dd" class="outline-3">
<h3 id="org46471dd"><span class="section-number-3">3.1.</span> reproductible and hermetic xsession script</h3>
<div class="outline-text-3" id="text-3-1">
<p>
What if you wanted to take the exact visual appearance of your window manager,
put it into a scheme file and "evaluate" it later? Read: reproducible rice.
</p>

<p>
As an experiment, I once created a custom package that, when installed into the
system profile, added an entry in <code>/share/xsessions/</code>. An entry that, when run
by the display manager, instructed it to execute a script <code>~/.startup</code>. I was
able to get from a display manager to an arbitrary script file while never
leaving Guix's tender embrace.
</p>

<p>
Of course, if the goal is to prolong this blissful moment, <code>~/.startup</code> should
be managed by guix too, right ?
</p>

<p>
In <code>guix home</code>'s <code>home-environment</code>, you can add a <code>home-files-service-type</code>
which lets you declare arbitrary "file-like objects" to be added into your home
directory. Could a g-expression turned into a script be such an object? Yes it
could.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(home-environment
 ...
 (services
  (list
   ...
   (simple-service 'environment-loader
                   home-files-service-type
                   `((<span style="color: #a0132f;">"startup"</span>
                      (program-file <span style="color: #a0132f;">"startup"</span> startup-gexp)))))))
</pre>
</div>

<p>
In my case, I did multiple things in this script.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">startup-gexp</span>
  #~(<span style="color: #005e8b; font-weight: bold;">begin</span>
      (system* #$nitrogen-bin <span style="color: #a0132f;">"--set-auto"</span> #wallpaper)
      (<span style="color: #005e8b; font-weight: bold;">when</span> (zero? (primitive-fork))
        (exit (system* #$sxhkd-bin <span style="color: #a0132f;">"-c"</span> #$sxhkd-config)))
      (system* #$i3-bin <span style="color: #a0132f;">"-c"</span> #$i3-config)))
</pre>
</div>

<p>
I started the keybindings daemon, I also started the window manager and set my
wallpaper. All without assuming that either sxhkd, nitrogen or i3 was installed.
I was even able to define my wallpaper as a fixed output derivation
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">wallpaper</span>
  (origin
    (uri <span style="color: #a0132f;">"https://www.dalipaintings.com/images/paintings/metamorphosis-of-narcissus.jpg"</span>)
    (method url-fetch)
    (sha256 (base32 <span style="color: #a0132f;">"0pn6dmqzakl88f1jxz7b325d98flkjx0fl9p7w2dfkiq3wbv9sn2"</span>))
    (file-name <span style="color: #a0132f;">"metamorphosis-of-narcissus.jpg"</span>)))
</pre>
</div>

<p>
Now, my whole setup is controlled by a single command.
</p>
</div>
</div>
