guix.org
** Code as data

Let's say I have a small function that I use in tandem with direnv to facilitate
the creation and the loading of anonymous guix profiles.

#+begin_src shell
function guix-load {
    anon_prof=~/.anonymous-profiles
    sorted_packages=`for i in $@;do
                         echo $i
                     done | sort | uniq`

    pkg_hash=`echo $sorted_packages | md5sum | awk '{print $1}'`

    if [ -d $anon_prof/$pkg_hash ]
    then
        true
    else
        printf "building $anon_prof/$pkg_hash...\n" > /dev/stderr
        mkdir -p $anon_prof/$pkg_hash
        guix install -p $anon_prof/$pkg_hash/profile $@
        if [ "$?" != "0" ];then
            printf "couldn't build profile\n"
            return
        fi
    fi
    
    prof=$anon_prof/$pkg_hash/profile

    printf "sourcing $prof...\n"
    GUIX_PROFILE=$prof . $prof/etc/profile
}

#+end_src


This function, when given a list of packages, will first check if a profile
containing this exact list exists (if it doesn't, create it) and loads this
profile. This is useful both as a shell command (an alternative to the slow
=guix environment --ad-hoc ...=) and inside direnv (a haskell project might
contain in its .envrc =guix-load ghc cabal-install stylish-haskell=) I can give
this file-like object to the direnv-service-type so that the service puts the
function in =~/.config/direnv/direnvrc= and in zsh-service-type so that it gets
included in zshrc.

Every time I want to modify the function, I can just modify it and run =guix
home reconfigure ~/guix/home.scm=. No need to remember to keep =guix-load.sh= in
a specific place or to synchronize the definition between two
places. Automatically copy pasting the contents of this file into other files
works well, because =guix-load= doesn't actually require any external
program. What about complex scripts ? You can do something similar, but it is
necessary to write a bit of code.

Let's say you have a script:

#+begin_src shell
#!/usr/bin/env sh
size=15
if [ -z "$1" ];then
	qrencode -s 15 -o - | feh -
else
	echo "$1" | qrencode -s 15 -o - | feh -
fi
#+end_src

You can't just drop it into your path or concatenate it with your bashrc: It
depends on external programs.

How do we solve this? I had three ideas.

1. We translate it into a g-expression

   This sucks, because command pipelines and shell scripts are a sometimes very
   appropriate for a given task. Rewriting it in scheme would be painful^(size
   script).

2. We translate the script into a =mixed-text-file= call, then wrap it in a
   =program-file=

   This also sucks, because it removes the ability to easily edit the script.

3. We wrap it with =wrap-program= (IIRC)

   Cool, because it enables you to edit the script as if it wasn't processed by
   guix at all. However it is not possible to use this method for functions that
   you want included into a startup file.

4. We expand the commands in the script into their full path.

   Similar to a .in file, this method would produce assumption-free scripts that
   you can append (monadically) to shell startup scripts.

   This is what I went with.

Unless I had written a shell script parser to know exactly which occurences of
"ps" to modify, I couldn't make this work on the original script file.

I opted for a syntax similar to .in files, this is what I came up with:

#+begin_src scheme
(define (expand-template file-like-object env)
  (with-imported-modules
   '((guix build utils))
   (let ((alist
          #~(#$@(map (lambda (pair) #~(#$(car pair) . #$(cadr pair)))
                     env))))
     (computed-file
      "expanded-file"
      #~(begin
          (use-modules (guix build utils))
          (copy-recursively #$file-like-object #$output)
          (let ((alist '#$alist))
            (with-fluid*
                %default-port-encoding "UTF-8" ;; otherwise, λ gets turned into "??"
	            (lambda () (substitute
                       #$output
                       (map
                        (lambda (pair)
                          (cons (string-append "%%" (car pair) "%%")
                                (lambda (line matches)
                                  (string-replace line
                                                  (cdr pair)
                                                  (car (vector-ref (car matches) 1))
                                                  (cdr (vector-ref (car matches) 1))))))
                        alist))))
            #$output))))))
#+end_src

This function takes a file-like object and a pseudo alist =((name package)...)
and returns the "expanded" file. This is what such a file looks like:

#+begin_src shell
function parse_git_branch() {
    branch=$(%%git%%/bin/git rev-parse --abbrev-ref HEAD 2> /dev/null)
    if [ -n "$branch" ]; then
        branch="${RED}(${GREEN}$branch${RED})${RESET} "
    else
		branch=""
    fi
    printf "%b" "$branch"
}
#+end_src

It works reasonably well.

