guix.html


<div id="outline-container-orgc823d94" class="outline-3">
<h3 id="orgc823d94"><span class="section-number-3">3.2.</span> Code as data</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Let's say I have a small function that I use in tandem with direnv to facilitate
the creation and the loading of anonymous guix profiles.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">guix-load</span> {
    <span style="color: #3548cf;">anon_prof</span>=~/.anonymous-profiles
    <span style="color: #3548cf;">sorted_packages</span>=<span style="color: #721045; font-weight: bold;">`for i in $@;do</span>
<span style="color: #721045; font-weight: bold;">                         echo $i</span>
<span style="color: #721045; font-weight: bold;">                     done | sort | uniq`</span>

    <span style="color: #3548cf;">pkg_hash</span>=<span style="color: #721045; font-weight: bold;">`echo $sorted_packages | md5sum | awk '{print $1}'`</span>

    <span style="color: #005e8b; font-weight: bold;">if</span> [ -d $<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span> ]
    <span style="color: #005e8b; font-weight: bold;">then</span>
        <span style="color: #721045; font-weight: bold;">true</span>
    <span style="color: #005e8b; font-weight: bold;">else</span>
        printf <span style="color: #a0132f;">"building $anon_prof/$pkg_hash...\n"</span> &gt; /dev/stderr
        mkdir -p $<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span>
        guix install -p $<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span>/profile $<span style="color: #3548cf;">@</span>
        <span style="color: #005e8b; font-weight: bold;">if</span> [ <span style="color: #a0132f;">"$?"</span> != <span style="color: #a0132f;">"0"</span> ];<span style="color: #005e8b; font-weight: bold;">then</span>
            printf <span style="color: #a0132f;">"couldn't build profile\n"</span>
            <span style="color: #005e8b; font-weight: bold;">return</span>
        <span style="color: #005e8b; font-weight: bold;">fi</span>
    <span style="color: #005e8b; font-weight: bold;">fi</span>
    
    <span style="color: #3548cf;">prof</span>=$<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span>/profile

    printf <span style="color: #a0132f;">"sourcing $prof...\n"</span>
    <span style="color: #3548cf;">GUIX_PROFILE</span>=$<span style="color: #3548cf;">prof</span> . $<span style="color: #3548cf;">prof</span>/etc/profile
}

</pre>
</div>


<p>
This function, when given a list of packages, will first check if a profile
containing this exact list exists (if it doesn't, create it) and loads this
profile. This is useful both as a shell command (an alternative to the slow
<code>guix environment --ad-hoc ...</code>) and inside direnv (a haskell project might
contain in its .envrc <code>guix-load ghc cabal-install stylish-haskell</code>) I can give
this file-like object to the direnv-service-type so that the service puts the
function in <code>~/.config/direnv/direnvrc</code> and in zsh-service-type so that it gets
included in zshrc.
</p>

<p>
Every time I want to modify the function, I can just modify it and run <code>guix
home reconfigure ~/guix/home.scm</code>. No need to remember to keep <code>guix-load.sh</code> in
a specific place or to synchronize the definition between two
places. Automatically copy pasting the contents of this file into other files
works well, because <code>guix-load</code> doesn't actually require any external
program. What about complex scripts ? You can do something similar, but it is
necessary to write a bit of code.
</p>

<p>
Let's say you have a script:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #595959; font-style: italic;">#</span><span style="color: #595959; font-style: italic;">!/usr/bin/</span><span style="color: #005e8b; font-weight: bold;">env</span><span style="color: #595959; font-style: italic;"> sh</span>
<span style="color: #3548cf;">size</span>=15
<span style="color: #005e8b; font-weight: bold;">if</span> [ -z <span style="color: #a0132f;">"$1"</span> ];<span style="color: #005e8b; font-weight: bold;">then</span>
    qrencode -s 15 -o - | feh -
<span style="color: #005e8b; font-weight: bold;">else</span>
    <span style="color: #721045; font-weight: bold;">echo</span> <span style="color: #a0132f;">"$1"</span> | qrencode -s 15 -o - | feh -
<span style="color: #005e8b; font-weight: bold;">fi</span>
</pre>
</div>

<p>
You can't just drop it into your path or concatenate it with your bashrc: It
depends on external programs.
</p>

<p>
How do we solve this? I had three ideas.
</p>

<ol class="org-ol">
<li><p>
We translate it into a g-expression
</p>

<p>
This sucks, because command pipelines and shell scripts are a sometimes very
appropriate for a given task. Rewriting it in scheme would be painful<sup>(size
script)</sup>.
</p></li>

<li><p>
We translate the script into a <code>mixed-text-file</code> call, then wrap it in a
<code>program-file</code>
</p>

<p>
This also sucks, because it removes the ability to easily edit the script.
</p></li>

<li><p>
We wrap it with <code>wrap-program</code> (IIRC)
</p>

<p>
Cool, because it enables you to edit the script as if it wasn't processed by
guix at all. However it is not possible to use this method for functions that
you want included into a startup file.
</p></li>

<li><p>
We expand the commands in the script into their full path.
</p>

<p>
Similar to a .in file, this method would produce assumption-free scripts that
you can append (monadically) to shell startup scripts.
</p>

<p>
This is what I went with.
</p></li>
</ol>

<p>
Unless I had written a shell script parser to know exactly which occurences of
"ps" to modify, I couldn't make this work on the original script file.
</p>

<p>
I opted for a syntax similar to .in files, this is what I came up with:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">define</span> (<span style="color: #8f0075;">expand-template</span> file-like-object env)
  (with-imported-modules
   '((guix build utils))
   (<span style="color: #005e8b; font-weight: bold;">let</span> ((alist
          #~(#$@(<span style="color: #005e8b; font-weight: bold;">map</span> (<span style="color: #005e8b; font-weight: bold;">lambda</span> (pair) #~(#$(car pair) . #$(cadr pair)))
                     env))))
     (computed-file
      <span style="color: #a0132f;">"expanded-file"</span>
      #~(<span style="color: #005e8b; font-weight: bold;">begin</span>
          (<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix build utils))
          (copy-recursively #$file-like-object #$output)
          (<span style="color: #005e8b; font-weight: bold;">let</span> ((alist '#$alist))
            (<span style="color: #005e8b; font-weight: bold;">with-fluid*</span>
                %default-port-encoding <span style="color: #a0132f;">"UTF-8"</span> <span style="color: #595959; font-style: italic;">;; </span><span style="color: #595959; font-style: italic;">otherwise, &#955; gets turned into "??"</span>
                (<span style="color: #005e8b; font-weight: bold;">lambda</span> () (substitute
                       #$output
                       (<span style="color: #005e8b; font-weight: bold;">map</span>
                        (<span style="color: #005e8b; font-weight: bold;">lambda</span> (pair)
                          (cons (string-append <span style="color: #a0132f;">"%%"</span> (car pair) <span style="color: #a0132f;">"%%"</span>)
                                (<span style="color: #005e8b; font-weight: bold;">lambda</span> (line matches)
                                  (string-replace line
                                                  (cdr pair)
                                                  (car (vector-ref (car matches) 1))
                                                  (cdr (vector-ref (car matches) 1))))))
                        alist))))
            #$output))))))
</pre>
</div>

<p>
This function takes a file-like object and a pseudo alist =((name package)&#x2026;)
and returns the "expanded" file. This is what such a file looks like:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">parse_git_branch</span>() {
    <span style="color: #3548cf;">branch</span>=$(%%git%%/bin/git rev-parse --abbrev-ref HEAD 2&gt; /dev/null)
    <span style="color: #005e8b; font-weight: bold;">if</span> [ -n <span style="color: #a0132f;">"$branch"</span> ]; <span style="color: #005e8b; font-weight: bold;">then</span>
        <span style="color: #3548cf;">branch</span>=<span style="color: #a0132f;">"${RED}(${GREEN}$branch${RED})${RESET} "</span>
    <span style="color: #005e8b; font-weight: bold;">else</span>
        <span style="color: #3548cf;">branch</span>=<span style="color: #a0132f;">""</span>
    <span style="color: #005e8b; font-weight: bold;">fi</span>
    printf <span style="color: #a0132f;">"%b"</span> <span style="color: #a0132f;">"$branch"</span>
}
</pre>
</div>

<p>
It works reasonably well.
</p>
</div>
</div>
</div>
