guix.org
* G-expressions

To hear it from the horse's mouth, read Ludovic Courtes' [[https://hal.inria.fr/hal-01580582/document][Code staging in GNU Guix]].


In guix, the standard way to create a derivation is to use the =derivation=
function.

#+begin_src scheme :results results
(use-modules (guix derivations)
             (guix store))

(derivation store "name-of-derivation" bash
            `("-e" "'echo salut > $out'"))
#+end_src


However, they are quite cumbersome to use. Also, blablablablabla

But we have G-expressions. Gexps are very similar to scheme's quasiquote, but
ungexp (the analog to unquote) has special behaviour with regards to file-like
object.

To create a G-expression, use the =gexp= form or it's abbreviation =#~=

#+begin_src scheme
(use-modules (guix gexp)
             (gnu packages base))

(gexp
 (begin
   (ungexp coreutils)
   salut))
#+end_src

#+RESULTS:
: #<gexp (begin #<gexp-input #<package coreutils@8.32 gnu/packages/base.scm:328 7fee02e080b0>:out> salut) 7fee01ecb240>

However, G-expressions are useful only in combination with other g-expressions
or when compiled down to a file-like object. Let's see how we can do that.

#+begin_src scheme
(use-modules (guix gexp)
             (gnu packages base))

(define exp
  (gexp
   (display "this is a test from a g-expression...\n")))


(program-file "exp" exp)
#+end_src

#+RESULTS:
: #<gexp (begin #<gexp-input "this is a test":out> salut) 7f12d1547f00>


 #+begin_src scheme
(use-modules (guix gexp)
             (gnu packages base))

(define some-list-of-packages (list coreutils coreutils))

(gexp
 (begin
   (ungexp some-list-of-packages)
   salut))
#+end_src

#+RESULTS:
: #<gexp (begin #<gexp-input (#<package coreutils@8.32 gnu/packages/base.scm:328 7f1517daf0b0> #<package coreutils@8.32 gnu/packages/base.scm:328 7f1517daf0b0>):out> salut) 7f1516ed1bd0>

* Profiles, environments and direnv

Guix's =guix shell= command makes it easy to very quickly spawn a shell in a
fresh profile with the given packages.


#+begin_src shell
guix shell guile guile-gi
#+end_src

However, for programs (or group of programs) that you use often or for setting
up environment variables for direnv, this method is not fast enough. One method
to accelerate the whole process is to bypass the evaluation of derivations
entirely for profiles that were built in the past and "cache" these profiles. A
very simple method is to keep a store of profiles which are "content-addressed"
by a hash of the packages that they contain.


#+begin_src shell
function guix-load {
    anon_prof=~/.anonymous-profiles
    sorted_packages=`for i in $@;do
                         echo $i
                     done | sort | uniq`

    pkg_hash=`echo $sorted_packages | md5sum | awk '{print $1}'`

    if [ -d $anon_prof/$pkg_hash ]
    then
        true
    else
        printf "building $anon_prof/$pkg_hash...\n" > /dev/stderr
        mkdir -p $anon_prof/$pkg_hash
        guix install -p $anon_prof/$pkg_hash/profile $@
        if [ "$?" != "0" ];then
            printf "couldn't build profile\n"
            return
        fi
    fi
    
    prof=$anon_prof/$pkg_hash/profile

    printf "sourcing $prof...\n"
    GUIX_PROFILE=$prof . $prof/etc/profile
}
#+end_src

While it is true that using =guix-load= will pollute your installation with
roots in =~/.anonymous-profiles=, it makes the "I want to run some program
without installing it" use case much more realisable.

Finally, it opens the door to another use case: loading anonymous profiles with
direnv. With this function in your direnvrc, you can simply drop something like
=guix-load texlive r graphviz ghc r-ggplot2 gnuplot aspell aspell-dict-fr= into
your =.envrc= and ensure that you will always be able to quickly (once the
initial buil is done) develop/compile/execute some project.

* Sending a patch

You just found your favorite piece of software, but it's an obsolete version
missing that cool new feature you need in your workflow. You went and =git
clone='ed the repo at [[https://git.savannah.gnu.org/git/guix.git][savannah]] and you modified the package definition. What
now? You should submit a patch, of course.

** Building Guix

Before you can test wether your modified package works, you need to build
guix. This can be done by invoking =guix shell= with guix's dependencies.

#+begin_src shell
guix shell -D guix
#+end_src

Then, you can run the bootstrap script.

#+begin_src shell
./bootstrap
#+end_src

And the configure script

#+begin_src shell
./configure --localstatedir=/var
#+end_src

Finally, you can build Guix.

#+begin_src shell
make
#+end_src

This might take a while, but after that is done, you end up with a working build
and a working =pre-inst-env= script with which you can begin to test the
package within the tree.

First, start by building your package.

#+begin_src shell
./pre-inst-env guix build tiramisu
#+end_src

When you have a working build, verify the output is working correctly, then use
the =guix lint= subcommand to verify you didn't make a silly mistake.

#+begin_src shell
./pre-inst-env guix lint tiramisu
#+end_src

After you are done, make sure you updated with your name the copyright header of
the files you modified, then make a commit.

** Committing your changes

When you write your commit message, make sure you follow GNU's [[https://www.gnu.org/prep/standards/html_node/Change-Logs.html][standard]] for
commit messages. In the case of tiramisu, that means writing something like:

#+begin_src text
gnu: tiramisu: Update to 2.0.
    
,* gnu/packages/gnome-xyz.scm (tiramisu): Update to 2.0.
#+end_src

If you are unsure about how a particular change should be expressed, simply run
=git log= and take inspiration from the other commits.

