guix.html

<div id="outline-container-org12b73a2" class="outline-2">
<h2 id="org12b73a2"><span class="section-number-2">4.</span> G-expressions</h2>
<div class="outline-text-2" id="text-4">
<p>
To hear it from the horse's mouth, read Ludovic Courtes' <a href="https://hal.inria.fr/hal-01580582/document">Code staging in GNU Guix</a>.
</p>


<p>
In guix, the standard way to create a derivation is to use the <code>derivation</code>
function.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix derivations)
             (guix store))

(derivation store <span style="color: #a0132f;">"name-of-derivation"</span> bash
            `(<span style="color: #a0132f;">"-e"</span> <span style="color: #a0132f;">"'echo salut &gt; $out'"</span>))
</pre>
</div>


<p>
However, they are quite cumbersome to use. Also, blablablablabla
</p>

<p>
But we have G-expressions. Gexps are very similar to scheme's quasiquote, but
ungexp (the analog to unquote) has special behaviour with regards to file-like
object.
</p>

<p>
To create a G-expression, use the <code>gexp</code> form or it's abbreviation <code>#~</code>
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix gexp)
             (gnu packages base))

(gexp
 (<span style="color: #005e8b; font-weight: bold;">begin</span>
   (ungexp coreutils)
   salut))
</pre>
</div>

<p>
However, G-expressions are useful only in combination with other g-expressions
or when compiled down to a file-like object. Let's see how we can do that.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix gexp)
             (gnu packages base))

(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">exp</span>
  (gexp
   (display <span style="color: #a0132f;">"this is a test from a g-expression...\n"</span>)))


(program-file <span style="color: #a0132f;">"exp"</span> exp)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix gexp)
             (gnu packages base))

(<span style="color: #005e8b; font-weight: bold;">define</span> <span style="color: #8f0075;">some-list-of-packages</span> (list coreutils coreutils))

(gexp
 (<span style="color: #005e8b; font-weight: bold;">begin</span>
   (ungexp some-list-of-packages)
   salut))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd836f8" class="outline-2">
<h2 id="orgdd836f8"><span class="section-number-2">5.</span> Profiles, environments and direnv</h2>
<div class="outline-text-2" id="text-5">
<p>
Guix's <code>guix shell</code> command makes it easy to very quickly spawn a shell in a
fresh profile with the given packages.
</p>


<div class="org-src-container">
<pre class="src src-shell">guix shell guile guile-gi
</pre>
</div>

<p>
However, for programs (or group of programs) that you use often or for setting
up environment variables for direnv, this method is not fast enough. One method
to accelerate the whole process is to bypass the evaluation of derivations
entirely for profiles that were built in the past and "cache" these profiles. A
very simple method is to keep a store of profiles which are "content-addressed"
by a hash of the packages that they contain.
</p>


<div class="org-src-container">
<pre class="src src-shell"><span style="color: #005e8b; font-weight: bold;">function</span> <span style="color: #8f0075;">guix-load</span> {
    <span style="color: #3548cf;">anon_prof</span>=~/.anonymous-profiles
    <span style="color: #3548cf;">sorted_packages</span>=<span style="color: #721045; font-weight: bold;">`for i in $@;do</span>
<span style="color: #721045; font-weight: bold;">                         echo $i</span>
<span style="color: #721045; font-weight: bold;">                     done | sort | uniq`</span>

    <span style="color: #3548cf;">pkg_hash</span>=<span style="color: #721045; font-weight: bold;">`echo $sorted_packages | md5sum | awk '{print $1}'`</span>

    <span style="color: #005e8b; font-weight: bold;">if</span> [ -d $<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span> ]
    <span style="color: #005e8b; font-weight: bold;">then</span>
        <span style="color: #721045; font-weight: bold;">true</span>
    <span style="color: #005e8b; font-weight: bold;">else</span>
        printf <span style="color: #a0132f;">"building $anon_prof/$pkg_hash...\n"</span> &gt; /dev/stderr
        mkdir -p $<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span>
        guix install -p $<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span>/profile $<span style="color: #3548cf;">@</span>
        <span style="color: #005e8b; font-weight: bold;">if</span> [ <span style="color: #a0132f;">"$?"</span> != <span style="color: #a0132f;">"0"</span> ];<span style="color: #005e8b; font-weight: bold;">then</span>
            printf <span style="color: #a0132f;">"couldn't build profile\n"</span>
            <span style="color: #005e8b; font-weight: bold;">return</span>
        <span style="color: #005e8b; font-weight: bold;">fi</span>
    <span style="color: #005e8b; font-weight: bold;">fi</span>
    
    <span style="color: #3548cf;">prof</span>=$<span style="color: #3548cf;">anon_prof</span>/$<span style="color: #3548cf;">pkg_hash</span>/profile

    printf <span style="color: #a0132f;">"sourcing $prof...\n"</span>
    <span style="color: #3548cf;">GUIX_PROFILE</span>=$<span style="color: #3548cf;">prof</span> . $<span style="color: #3548cf;">prof</span>/etc/profile
}
</pre>
</div>

<p>
While it is true that using <code>guix-load</code> will pollute your installation with
roots in <code>~/.anonymous-profiles</code>, it makes the "I want to run some program
without installing it" use case much more realisable.
</p>

<p>
Finally, it opens the door to another use case: loading anonymous profiles with
direnv. With this function in your direnvrc, you can simply drop something like
<code>guix-load texlive r graphviz ghc r-ggplot2 gnuplot aspell aspell-dict-fr</code> into
your <code>.envrc</code> and ensure that you will always be able to quickly (once the
initial buil is done) develop/compile/execute some project.
</p>
</div>
</div>

<div id="outline-container-org376b80e" class="outline-2">
<h2 id="org376b80e"><span class="section-number-2">6.</span> Sending a patch</h2>
<div class="outline-text-2" id="text-6">
<p>
You just found your favorite piece of software, but it's an obsolete version
missing that cool new feature you need in your workflow. You went and <code>git
clone</code>'ed the repo at <a href="https://git.savannah.gnu.org/git/guix.git">savannah</a> and you modified the package definition. What
now? You should submit a patch, of course.
</p>
</div>

<div id="outline-container-org4e162b9" class="outline-3">
<h3 id="org4e162b9"><span class="section-number-3">6.1.</span> Building Guix</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Before you can test wether your modified package works, you need to build
guix. This can be done by invoking <code>guix shell</code> with guix's dependencies.
</p>

<div class="org-src-container">
<pre class="src src-shell">guix shell -D guix
</pre>
</div>

<p>
Then, you can run the bootstrap script.
</p>

<div class="org-src-container">
<pre class="src src-shell">./bootstrap
</pre>
</div>

<p>
And the configure script
</p>

<div class="org-src-container">
<pre class="src src-shell">./configure --localstatedir=/var
</pre>
</div>

<p>
Finally, you can build Guix.
</p>

<div class="org-src-container">
<pre class="src src-shell">make
</pre>
</div>

<p>
This might take a while, but after that is done, you end up with a working build
and a working <code>pre-inst-env</code> script with which you can begin to test the
package within the tree.
</p>

<p>
First, start by building your package.
</p>

<div class="org-src-container">
<pre class="src src-shell">./pre-inst-env guix build tiramisu
</pre>
</div>

<p>
When you have a working build, verify the output is working correctly, then use
the <code>guix lint</code> subcommand to verify you didn't make a silly mistake.
</p>

<div class="org-src-container">
<pre class="src src-shell">./pre-inst-env guix lint tiramisu
</pre>
</div>

<p>
After you are done, make sure you updated with your name the copyright header of
the files you modified, then make a commit.
</p>
</div>
</div>

<div id="outline-container-org7fde185" class="outline-3">
<h3 id="org7fde185"><span class="section-number-3">6.2.</span> Committing your changes</h3>
<div class="outline-text-3" id="text-6-2">
<p>
When you write your commit message, make sure you follow GNU's <a href="https://www.gnu.org/prep/standards/html_node/Change-Logs.html">standard</a> for
commit messages. In the case of tiramisu, that means writing something like:
</p>

<div class="org-src-container">
<pre class="src src-text">gnu: tiramisu: Update to 2.0.
    
* gnu/packages/gnome-xyz.scm (tiramisu): Update to 2.0.
</pre>
</div>

<p>
If you are unsure about how a particular change should be expressed, simply run
<code>git log</code> and take inspiration from the other commits.
</p>
</div>
</div>
