guix.org
** Creating a patch file

When you have committed your changes, it is time to turn the commit into a patch
file. This can be done with the =git format-patch= command:

#+begin_src shell
git format-patch HEAD~1
#+end_src

A patch file should have appeared in the directory. Now, you can add this file
as an attachment to an email sent to [[mailto:guix-patches@gnu.org][guix-patches@gnu.org]].

* Other resources

- [[https://www.youtube.com/channel/UCuj_loxODrOPxSsXDfJmpng][Andrew Tropin's channel]]

  He's =guix home='s author, so obviously, he knows a lot about Guix.

- [[https://guix.gnu.org/en/manual/devel/en/guix.html][The manual]]

- [[https://guix.gnu.org/en/cookbook/en/guix-cookbook.html][The cookbook]]


* Snippets

** Build a derivation from scheme
#+begin_src scheme
(use-modules (guix gexp)
             (guix derivations)
             (guix store))

(let ((s (open-connection))
      (script
       (gexp
        (begin
          (display (command-line)) (newline)))))
  (let ((d (run-with-store s (gexp->script "some-script" script))))
    (build-derivations s (list d))
    (derivation-output-path (assoc-ref (derivation-outputs d) "out"))))
#+end_src

#+RESULTS:
: /gnu/store/xd3lz6mivk9z0i1qajgb8iz9b796sb32-some-script
