guix.html

<div id="outline-container-org195eee6" class="outline-3">
<h3 id="org195eee6"><span class="section-number-3">6.3.</span> Creating a patch file</h3>
<div class="outline-text-3" id="text-6-3">
<p>
When you have committed your changes, it is time to turn the commit into a patch
file. This can be done with the <code>git format-patch</code> command:
</p>

<div class="org-src-container">
<pre class="src src-shell">git format-patch HEAD~1
</pre>
</div>

<p>
A patch file should have appeared in the directory. Now, you can add this file
as an attachment to an email sent to <a href="mailto:guix-patches@gnu.org">guix-patches@gnu.org</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org1c7b803" class="outline-2">
<h2 id="org1c7b803"><span class="section-number-2">7.</span> Other resources</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><p>
<a href="https://www.youtube.com/channel/UCuj_loxODrOPxSsXDfJmpng">Andrew Tropin's channel</a>
</p>

<p>
He's <code>guix home</code>'s author, so obviously, he knows a lot about Guix.
</p></li>

<li><a href="https://guix.gnu.org/en/manual/devel/en/guix.html">The manual</a></li>

<li><a href="https://guix.gnu.org/en/cookbook/en/guix-cookbook.html">The cookbook</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgeb5015d" class="outline-2">
<h2 id="orgeb5015d"><span class="section-number-2">8.</span> Snippets</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org3079a41" class="outline-3">
<h3 id="org3079a41"><span class="section-number-3">8.1.</span> Build a derivation from scheme</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #005e8b; font-weight: bold;">use-modules</span> (guix gexp)
             (guix derivations)
             (guix store))

(<span style="color: #005e8b; font-weight: bold;">let</span> ((s (open-connection))
      (script
       (gexp
        (<span style="color: #005e8b; font-weight: bold;">begin</span>
          (display (command-line)) (newline)))))
  (<span style="color: #005e8b; font-weight: bold;">let</span> ((d (run-with-store s (gexp-&gt;script <span style="color: #a0132f;">"some-script"</span> script))))
    (build-derivations s (list d))
    (derivation-output-path (assoc-ref (derivation-outputs d) <span style="color: #a0132f;">"out"</span>))))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Justin Veilleux</p>
<p class="date">Created: 2024-09-15 Sun 21:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
